%%本程序演示利用Gaussian函数对输入信号进行低通滤波。
t1=-1.5:0.01:1.5;
t2=-1.5:0.01:1.5;
b1=[zeros(1,50),ones(1,200),zeros(1,51)];
%%-----------------产生滤波器1,a=0.25------------------------------------%%
y1=sqrt(pi)/0.25*exp(-((pi*t1).^2)/0.25.^2);    %公式见h(t)
z1=0.5*(erfc(pi/0.25*(t1-1))-erfc(pi/0.25*(t1+1)));     %公式见g(t)
%%-----------------产生滤波器2,a=0.5------------------------------------%%
y2=sqrt(pi)/0.5*exp(-((pi*t1).^2)/0.5.^2);
z2=0.5*(erfc(pi/0.5*(t1-1))-erfc(pi/0.5*(t1+1)));
%%-----------------产生滤波器3,a=1------------------------------------%%
y3=sqrt(pi)*exp(-(pi*t1).^2);
z3=0.5*(erfc(pi*(t1-1))-erfc(pi*(t1+1)));
%%-----------------产生滤波器4,a=2------------------------------------%%
y4=sqrt(pi)/2*exp(-((pi*t1).^2)/2.^2);
z4=0.5*(erfc(pi/2*(t1-1))-erfc(pi/2*(t1+1)));
%%----------------------------绘图命令----------------------------%%
%------------------------绘制高斯脉冲成形滤波器的输入(矩形脉冲)-------------
subplot(3,1,1),plot(t2,b1);axis([-1.5 1.5 0 1.2]);xlabel('t/T');ylabel('b(t)');
title('高斯脉冲成形滤波器的输入(矩形脉冲)');
%-----------------------绘制高斯脉冲成形滤波器的冲激响应h(t)-----------------
subplot(3,1,2),plot(t1,y1,'r',t1,y2,'g',t1,y3,'b',t1,y4,'m');
legend('\alpha=0.25','\alpha=0.5','\alpha=1','\alpha=2');
xlabel('t/T');ylabel('h(t)');title('高斯脉冲成形滤波器的冲激响应h(t)');
%--------------------绘制不同alpha值时高斯滤波器的输出g(t):----------------
%--------------------------------该值用z1至z4表示---------------------------
subplot(3,1,3),plot(t1,z1,'r',t1,z2,'g',t1,z3,'b',t1,z4,'m');
xlabel('t/T');ylabel('g(t)');
legend('\alpha=0.25','\alpha=0.5','\alpha=1','\alpha=2');
axis([-1.5 1.5 0 1.2]);
title('高斯脉冲成形滤波器的输出');





















