%%本程序仿真升余弦滤波器对信号的影响。采用MATLAB工具箱中专门用于升余弦FIR
%滤波器的指令[NUM,DEN]=RCOSINE(Fd,Fs,TYPE_FLAG,R),可以返回一个具有升余弦过
%渡带的低通线性相位FIR滤波器，截止频率为Fd，滚降系数为R，采样频率为Fs,
%TYPE_FLAG规定设计的是规范的升余弦函数(用'normal'表示)还是平方根升余弦滤波
%器(用'sqrt'表示)，用整型参数Delay设置延时。
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%设置参量，采用4倍采样速率，滚降系数为0.5
Fd=1;Fs=4;Delay=2;R=0.5;
%--------------------------建立升余弦滚降滤波器----------------------------
[yf,tf]=rcosine(Fd,Fs,'fir/normal',R,Delay);
%画图得到升余弦滚降滤波器波形
%b1=ones(1,length(t2));     %滤波器输入矩形脉冲
figure(1);
subplot(3,1,1);
plot(yf);     
grid;
xlabel('Time');
ylabel('Amplitude');
title('升余弦滚降滤波器h(t)');
%-------------定义一个与二元序列对应的时间序列作为原始信号-------------
x=[zeros(1,10),ones(1,10),ones(1,10),zeros(1,10),zeros(1,10),zeros(1,10)];
y=filter(yf,tf,x)/Fs;  %filter(B,A,X)命令是使用一个由向量A和B构成的一维数字滤波器对数据x进行滤波，其2维应用可参考filter2命令
%画出原始信号波形
subplot(3,1,2);
plot(x);
axis([0,61,-0.2,1.2]);
title('原始信号');
%--------------原始信号通过升余弦滚降滤波器后的输出------------------------
subplot(3,1,3);
plot(y);
axis([2,61,-0.2,1.2]);
title('滤波后输出');
grid;



















